In [ ]:
import datasets
from datasets import load_dataset
dataset = load_dataset('lukebarousse/data_jobs')

df = dataset['train'].to_pandas()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

## Aggregations & Grouping

1. Count jobs by job title

In [ ]:
df_job_count = df.groupby('job_title_short').size().reset_index(name='job_count').sort_values(by = 'job_count' , ascending = False)
df_job_count

             job_title_short  job_count
2               Data Analyst     196075
3              Data Engineer     186241
4             Data Scientist     172286
0           Business Analyst      49063
9          Software Engineer      44929
7       Senior Data Engineer      44563
8      Senior Data Scientist      36957
6        Senior Data Analyst      29216
5  Machine Learning Engineer      14080
1             Cloud Engineer      12331

2. Average salary by country

In [5]:
avg_salary_by_country = df[df['salary_year_avg'].notna()]
avg_salary_by_country =(avg_salary_by_country.groupby('job_country')['salary_year_avg']
                        .mean()
                        .astype(int)     
                        .reset_index(name='avg_salary')
                        .sort_values(by = 'avg_salary',ascending = False)
)
avg_salary_by_country

                  job_country  avg_salary
9                     Belarus      400000
80                     Russia      292500
7                     Bahamas      201511
27         Dominican Republic      157500
69   Northern Mariana Islands      155485
..                        ...         ...
37                   Honduras       63000
8                  Bangladesh       60981
60                 Montenegro       53014
1                     Algeria       44550
104                Uzbekistan       30750

[108 rows x 2 columns]

3. Top 5 countries by job count

In [6]:
top_5_countries =(df.groupby('job_country')['job_title_short'].size()
                  .reset_index(name = 'job_count')
                  .sort_values(by = 'job_count', ascending=False)
                  .head(5)
                  )
top_5_countries

        job_country  job_count
152   United States     206292
63            India      51088
151  United Kingdom      40375
48           France      39922
50          Germany      27694

4. Highest paying job title

In [7]:
highest_paying_job =(df.groupby('job_title_short')['salary_year_avg']
                     .max()
                     .reset_index(name= 'highest_salary')
                     .sort_values(by = 'highest_salary', ascending = False)
                     .head(1)
                     )
highest_paying_job

  job_title_short  highest_salary
4  Data Scientist        960000.0

5. Average salary by work type (remote / onsite)

In [8]:
work_type_salary = (df.groupby('job_work_from_home')['salary_year_avg']
                   .mean()
                   .astype(int)
                   .reset_index(name = 'avg_salary')
                   .sort_values(by = 'avg_salary',ascending=False)
                   )
work_type_salary

   job_work_from_home  avg_salary
1                True      131601
0               False      121830

6. Job count by company

In [9]:
job_by_company =(df.groupby('company_name')['job_title_short']
                 .size()
                 .reset_index(name = 'job_count')
                 .sort_values(by = 'job_count',ascending = False)
                 )
job_by_company

              company_name  job_count
39719              Emprego       6664
18371  Booz Allen Hamilton       2879
34860                 Dice       2827
53029              Harnham       2547
60218       Insight Global       2254
...                    ...        ...
88539         PSK's Client          1
88538                  PSK          1
39123       Elena Martínez          1
88536        PSICOTEC S.A.          1
0                  "Dbank"          1

[139982 rows x 2 columns]

7. Average salary by job schedule

In [15]:
avg_salary_by_shedule = df[df['salary_year_avg'].notna()]
avg_salary_by_shedule =(avg_salary_by_shedule.groupby('job_schedule_type')['salary_year_avg']
                 .mean()
                 .round()
                 .reset_index(name = 'avg_salary')
                 .sort_values(by = 'avg_salary',ascending = False)
                 )
avg_salary_by_shedule

                        job_schedule_type  avg_salary
19   Part-time, Contractor, and Temp work    320000.0
5                 Full-time and Part-time    143442.0
12    Full-time, Part-time, and Temp work    139526.0
10   Full-time, Part-time, and Contractor    134968.0
18                Part-time and Full-time    126000.0
2                               Full-time    123645.0
11   Full-time, Part-time, and Internship    123225.0
7                 Full-time and Temp work    111187.0
3                Full-time and Contractor    104875.0
0                              Contractor    103662.0
9    Full-time, Contractor, and Temp work    102371.0
15               Internship and Full-time     94700.0
16                              Part-time     92630.0
1                Contractor and Temp work     86472.0
14                             Internship     82108.0
6                  Full-time and Per diem     82010.0
20                              Temp work     79464.0
4                Full-time and Internship     78723.0
13   Full-time, Temp work, and Internship     67818.0
17               Part-time and Contractor     66911.0
8   Full-time, Contractor, and Internship     65000.0

8. % of remote jobs

In [11]:

percent_remote = (df['job_work_from_home'] == True).sum() / len(df) * 100
percent_remote = round(percent_remote, 2)
percent_remote

np.float64(8.85)

9. Compare degree vs non-degree salary

In [12]:
degree_salary = (df.groupby('job_no_degree_mention')['salary_year_avg'].mean()
                .astype(int)
                .reset_index(name = 'avg_salary')
                .sort_values(by = 'avg_salary', ascending = False))
degree_salary

   job_no_degree_mention  avg_salary
0                  False      125045
1                   True      113613

10. Top 10 highest paying companies

In [13]:
top_10_companies = (df.groupby('company_name')['salary_year_avg'].mean()
                    .round()
                    .reset_index(name='salary')
                    .sort_values(by = 'salary',ascending=False)
                    .head(10))
top_10_companies

                                       company_name    salary
73551                             MSP Staffing  LTD  890000.0
74673                                        Mantys  650000.0
97421                                       ReServe  585000.0
38228   East River Electric Power Cooperative, Inc.  537000.0
128881                                     WhatsApp  463500.0
137864                                        ЛАНИТ  400000.0
50575                             Greenfield Source  390000.0
58531                  Illuminate Mission Solutions  375000.0
33728                                      Deepcell  375000.0
16847                                      Big Lots  375000.0